In [64]:
import numpy as np
import pandas as pd
from typing import Union

# Operation on Data in Pandas

In [65]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [66]:
df = pd.DataFrame(rng.randint(0,10,(3,4)), 
                 columns=["A", "B", "C", "D"])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [67]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [68]:
np.sin(df*np.pi/4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [69]:
area = pd.Series({"Alaska": 1723337, "Texas":695662,
                 "California":423967}, name="area")
population = pd.Series({"California":38332521, "Texas": 26448193,
                      "New York":19651127}, name="population")

In [70]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [71]:
# Union[area.index, population.index].any()

In [72]:
A = pd.Series([2,4,6], index=[0,1,2])
B = pd.Series([1,3,5], index=[1,2,3])
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [73]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [74]:
A = pd.DataFrame(rng.randint(0,20,(2,2)),
                columns=list("AB"))
A

   A   B
0  1  11
1  5   1

In [75]:
B = pd.DataFrame(rng.randint(0,10,(3,3)),
                columns=list("BAC"))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [76]:
A+B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [77]:
A.add(B, fill_value=0)

      A     B    C
0   1.0  15.0  9.0
1  13.0   6.0  0.0
2   2.0   9.0  6.0

In [78]:
A.sub(B, fill_value=0)

     A    B    C
0  1.0  7.0 -9.0
1 -3.0 -4.0  0.0
2 -2.0 -9.0 -6.0

In [79]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

In [80]:
A = rng.randint(10, size=(3,4))
A

array([[3, 8, 2, 4],
       [2, 6, 4, 8],
       [6, 1, 3, 8]])

In [81]:
A-A[0]

array([[ 0,  0,  0,  0],
       [-1, -2,  2,  4],
       [ 3, -7,  1,  4]])

In [82]:
df = pd.DataFrame(A, columns=list("QRST"))

print(f"{df}\n\n{df.iloc[0]}\n")

df - df.iloc[0]

   Q  R  S  T
0  3  8  2  4
1  2  6  4  8
2  6  1  3  8

Q    3
R    8
S    2
T    4
Name: 0, dtype: int64

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [83]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

In [84]:
halfrow = df.iloc[0, ::2]
halfrow

Q    3
S    2
Name: 0, dtype: int64

In [85]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN  2.0 NaN
2  3.0 NaN  1.0 NaN

# Handling Missing Data

In [86]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [87]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
45.4 ms ± 2.74 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
1.24 ms ± 29 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [88]:
# vals1.sum()

In [89]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [90]:
1+np.nan

nan

In [91]:
0*np.nan

nan

In [92]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [93]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

**NaN and None is Pandas**

In [94]:
pd.Series([1,np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [95]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [96]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

**Operating on Null Values**

**Detecting null values**

In [97]:
data = pd.Series([1, np.nan, "Hello", None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [98]:
data[data.notnull()]

0        1
2    Hello
dtype: object

**Dropping null values**

In [99]:
data.dropna()

0        1
2    Hello
dtype: object

In [100]:
df = pd.DataFrame(
    [
        [1, np.nan, 2],
        [2, 3, 5],
        [np.nan, 4, 6]
    ]
)
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [101]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [102]:
df.dropna(axis="columns")

   2
0  2
1  5
2  6

In [103]:
df[3] = np.nan

In [104]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [105]:
df.dropna(axis="columns", how="all")

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [106]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

**Filling null values**

In [107]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [108]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [109]:
# forward-fill
data.fillna(method="ffill")

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [110]:
# back-fill 
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [111]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [112]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

# Hierarchial Indexing

**A Multiply Indexed Series**

***The bad way***

In [113]:


index = [
    ("California", 2000),
    ("California", 2010),
    ("New York", 2000),
    ("New York", 2010),
    ("Texas", 2000),
    ("Texas", 2010)
]
populations = [
    33871648,
    37253956,
    18976457,
    19378102,
    20851820,
    25145561
]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [114]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

***The Better Way : Pandas Multiplex***

In [115]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [116]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [117]:
pop[:, 2000]

California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [118]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [119]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [120]:
pop_df = pd.DataFrame(
{
    "total": pop,
    "under18":[
        9268089, 9284084,
        4687374, 4318033,
        5906301, 6879014
    ]
})
pop_df

                    total  under18
California 2000  33871648  9268089
           2010  37253956  9284084
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [121]:
f_u18 = pop_df["under18"] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273624  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

**Methods of MultiIndex Creation**

In [122]:
df = pd.DataFrame(
    np.random.rand(4,2),
    index = [['a','a','b','b'], [1,2,1,2]],
    columns = ['data1', 'data2']
)
df

        data1     data2
a 1  0.716846  0.792275
  2  0.337140  0.884705
b 1  0.007229  0.212205
  2  0.902431  0.895706

In [123]:
data = {
    ('California', 2000): 33871648,
    ('California', 2010): 37253956,
    ('Texas', 2000): 20851820,
    ('Texas', 2010): 25145561,
    ('New York', 2000): 18976457,
    ('New York', 2010): 19378102
}
data

{('California', 2000): 33871648,
 ('California', 2010): 37253956,
 ('Texas', 2000): 20851820,
 ('Texas', 2010): 25145561,
 ('New York', 2000): 18976457,
 ('New York', 2010): 19378102}

*Explicit MultiIndex constructors*

In [124]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [125]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [126]:
pd.MultiIndex.from_product([['a', 'b'], [1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [127]:
# pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
#               labels=[[0,0,1,1], [0,1,0,1]])

*MultiIndex Level names*

In [130]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

*MultiIndex for columns*

In [134]:
# hierarchial indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1,2]],
                                  names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                    names=['subject', 'type'])

# mock some data 
data = np.round(np.random.randn(4,6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame 
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      25.0  38.0  37.0  35.5  37.0  37.0
     2      40.0  35.6  29.0  36.4  40.0  34.9
2014 1      42.0  37.1  46.0  37.8  54.0  36.7
     2      27.0  36.7  50.0  37.2  33.0  36.6

In [146]:
# data = np.round(np.random.randn(4,6), 1)
# data[:, ::2] *= 10
# data+=37
# data

array([[41. , 38.2, 30. , 37.4, 44. , 37.9],
       [35. , 36.6, 53. , 37.2, 42. , 35.9],
       [61. , 34.8, 30. , 37.3, 22. , 35.2],
       [21. , 38. , 33. , 36.7, 31. , 36.6]])